window.IRAN_CITIES = [
    {
        "name": "آذربایجان شرقی",
        "cities": ["تبریز", "مراغه", "مرند", "میانه", "اهر", "بناب", "سراب", "آذرشهر", "هادی‌شهر", "عجب‌شیر", "سردرود", "ملکان", "شبستر", "خسروشاه", "بستان‌آباد", "هشترود", "گوگان", "ممقان", "یامچی", "خامنه", "کشکسرای", "تسوج", "کلوانق", "ترکمانچای", "لیلان", "صوفیان", "شندآباد", "قره‌آغاج", "داش‌بلاغ", "تیکمه‌داش", "آبش‌احمد", "ترک", "خمارلو", "خداجو", "سیه‌رود", "نظرکهریزی", "بخشایش", "شهرجدیدسهند", "کلیبر", "اسکو", "ورزقان", "حریس", "خاروانا", "هوراند", "زنوز", "وایقان", "شربین", "تیمورلو", "زرنق", "مبارک‌شهر", "کوزه‌کنان", "شرفخانه", "خواجه", "دوزدوزان"]
    },
    {
        "name": "آذربایجان غربی",
        "cities": ["ارومیه", "خوی", "بوکان", "مهاباد", "میاندوآب", "سلماس", "پیرانشهر", "نقده", "تکاب", "ماکو", "سردشت", "شاهین‌دژ", "اشنویه", "قره‌ضیاءالدین", "شوط", "سیه‌چشمه", "ربط", "پلدشت", "بازرگان", "چهاربرج", "محمدیار", "فیرورق", "تازه‌شهر", "نوشین", "دیزج‌دیز", "محمودآباد", "میرآباد", "کوتول", "باروق", "گردکشانه", "نلاس", "قوشچی", "کشاورز", "یولاگلدی", "ایواوغلی", "سیلوانه", "بوجه", "سرو", "زرآباد", "خلیفان", "چایپاره"]
    },
    {
        "name": "اردبیل",
        "cities": ["اردبیل", "پارس‌آباد", "مشگین‌شهر", "خلخال", "گرمی", "بیله‌سوار", "نمین", "گیوی", "جعفرآباد", "اصلاندوز", "کوثر", "عنبران", "هشتجین", "سرعین", "اسلام‌آباد", "تازه", "کلور", "نیر", "لاهرود", "هیر", "قصابه", "رضی", "فخرآباد", "آبی‌بیگلو", "مرادلو", "کوراییم"]
    },
    {
        "name": "اصفهان",
        "cities": ["اصفهان", "کاشان", "خمینی‌شهر", "نجف‌آباد", "شاهین‌شهر", "دارام", "شهرضا", "تیران", "مبارکه", "زرین‌شهر", "آران و بیدگل", "گلپایگان", "فریدون‌شهر", "درچه", "چادگان", "فلاورجان", "دولت‌آباد", "نایین", "سمیرم", "خوانسار", "گز", "اردستان", "قهدریجان", "خورزوق", "کلیشاد و سودرجان", "فولادشهر", "بهارستان", "خور", "دستگرد", "ابریشم", "قمصر", "نیاسر", "نوش‌آباد", "برزک", "سفیدشهر", "مشکات", "طالخونچه", "کرکوند", "زیباشهر", "مجلسی", "دیزیچه", "ورنامخواست", "چرمهین", "باغ‌بهادران", "باغشاد", "زاینده‌رود", "سده‌لنجان", "چمگردان", "پیربکران", "ایمانشهر", "بهاران‌شهر", "قهدریجان", "کلیشادوسودرجان", "زازران", "شهرابریشم", "تودشک", "کوهپایه", "سگزی", "مجلسی", "بهارستان", "نیک‌آباد", "محمدآباد", "نصرآباد", "حسن‌آباد", "ورزنه", "هرند", "اژیه", "زیار", "قهجاورستان", "پیربکران", "بهاران", "زازران", "وزوان", "لایبید", "گرگاب", "میمه", "شاهین‌شهر", "گزبرخوار", "خورزوق", "دستگرد", "دولت‌آباد", "سین", "شاپورآباد", "حبیب‌آباد", "کمیشجه"]
    },
    {
        "name": "البرز",
        "cities": ["کرج", "فردیس", "کمال‌شهر", "نظرآباد", "محمدشهر", "ماهدشت", "مشکین‌دشت", "هشتگرد", "چهارباغ", "اشتهارد", "گرمدره", "گلسار", "کوهسار", "تنکمان", "طالقان", "آسارا", "پلنگ‌آباد"]
    },
    {
        "name": "ایلام",
        "cities": ["ایلام", "دهلران", "ایوان", "آبدانان", "دره‌شهر", "مهران", "سرابله", "ارکواز", "آسمان‌آباد", "چوار", "پهله", "بدره", "شباب", "دلگشا", "مورموری", "زرنه", "لومار", "موسیان", "میمه", "سراب‌باغ", "صالح‌آباد", "بلاوه", "توحید"]
    },
    {
        "name": "بوشهر",
        "cities": ["بوشهر", "برازجان", "بندر گناوه", "بندر کنگان", "خورموج", "جم", "بندر دیر", "عالی‌شهر", "آب‌پخش", "چغادک", "اهرم", "بندر عسلویه", "وحدتیه", "کاکی", "بندر دیلم", "سعدآباد", "خارک", "شبانکاره", "بردستان", "بندر ریگ", "دالکی", "بندر سیراف", "آباد", "انارستان", "تنگ‌ارم", "ریز", "شنبه", "امام‌حسن", "کلمه", "بوشکان", "دوراهک", "بادوله", "بنک", "نخل‌تقی"]
    },
    {
        "name": "تهران",
        "cities": ["تهران", "اسلام‌شهر", "گلستان", "قدس", "ملارد", "ورامین", "شهریار", "قرچک", "نسیم‌شهر", "پاکدشت", "پرند", "اندیشه", "رباط‌کریم", "بومهن", "باقرشهر", "پیشوا", "صالحیه", "صباشهر", "چهاردانگه", "دماوند", "حسن‌آباد", "کهریزک", "فردوسیه", "وحیدیه", "صفادشت", "نصیرشهر", "رودهن", "شاهدشهر", "پرذیس", "فرون‌آباد", "شریف‌آباد", "لواسان", "فیروزکوه", "آبسرد", "شمشک", "احمدآبادمستوفی", "کیلان", "آبعلی", "ارجمند", "جوادآباد", "فرون‌آباد", "قیامدشت", "قلعه‌نو", "خاورشهر", "سعیدآباد", "خسروآباد"]
    },
    {
        "name": "چهارمحال و بختیاری",
        "cities": ["شهرکرد", "بروجن", "لردگان", "فرخ‌شهر", "فارسان", "هفشجان", "جونقان", "سامان", "فرادنبه", "بن", "کیان", "سورشجان", "بلداجی", "باباحیدر", "اردل", "نقنه", "پرنجان", "شلمزار", "گندمان", "گهرو", "گوجان", "طاقانک", "ناغان", "سردشت", "سودجان", "سفیددشت", "آلونی", "دستنا", "چلیچه", "وردنجان", "کاج", "نافچ", "مال‌خلیفه", "چمن‌سلطان", "دشتک", "هارونی", "چلگرد", "سرخون", "بازفت", "منج", "صمصامی"]
    },
    {
        "name": "خراسان جنوبی",
        "cities": ["بیرجند", "قاین", "طبس", "فردوس", "نهبندان", "بشرویه", "سرایان", "سربیشه", "اسلامیه", "حاجی‌آباد", "خوسف", "خضری دشت بیاض", "اسدیه", "آیسک", "نیمبلوک", "طبس‌مسینا", "سه قلعه", "ارسک", "عشق‌آباد", "آرین‌شهر", "اسفدن", "مود", "شوسف", "دیهوک", "شاسکوه", "محمدشهر", "گزیک", "قهستان", "زهان"]
    },
    {
        "name": "خراسان رضوی",
        "cities": ["مشهد", "نیشابور", "سبزوار", "تربت حیدریه", "کاشمر", "قوچان", "تربت جام", "تایباد", "چناران", "سرخس", "گناباد", "فریمان", "گلبهار", "درگز", "خواف", "بردسکن", "طرقبه", "فیض‌آباد", "نقاب", "شاندیز", "خرو", "بجستان", "کاریز", "مشهدریزه", "احمدآبادصولت", "جنگل", "کندر", "نصرآباد", "نیل‌شهر", "رشتخوار", "قدمگاه", "داورزن", "خلیل‌آباد", "سنگان", "نشتیفان", "باخرز", "فرهادگرد", "قلندرآباد", "سلامی", "جغتای", "رونیز", "شهرزو", "صالح‌آباد", "بیدخت", "رباط‌سنگ", "ششتمد", "مزدآوند", "کاخک", "شادمهر", "بار", "سفیدسنگ", "سلطان‌آباد", "عشق‌آباد", "شامکان", "حکم‌آباد", "ریوش", "عباس‌آباد", "همت‌آباد", "چکنه", "مزداوند", "لطف‌آباد", "قاسم‌آباد", "باجگیران", "یونسی"]
    },
    {
        "name": "خراسان شمالی",
        "cities": ["بجنورد", "شیروان", "اسفراین", "آشخانه", "جاجرم", "فاروج", "گرمّه", "درق", "ایور", "صفی‌آباد", "تیتکانلو", "راز", "شوقان", "سنخواست", "پیش‌قلعه", "حصارگرم‌خان", "لوجلی", "قاضی", "آوا"]
    },
    {
        "name": "خوزستان",
        "cities": ["اهواز", "دزفول", "آبادان", "ماهشهر", "اندیمشک", "خرمشهر", "بهبهان", "ایذه", "شوشتر", "مسجدسلیمان", "بندر امام خمینی", "رامهرمز", "امیدیه", "شوش", "شادگان", "سوسنگرد", "چمران", "هندیجان", "شیبان", "باغ‌ملک", "رامشیر", "گتوند", "حمیدیه", "لالی", "هویزه", "ویس", "ملاثانی", "شرافت", "دزآب", "قلعه‌تل", "صفی‌آباد", "میانرود", "بستان", "هفتگل", "الوان", "سالند", "آغاجاری", "صالح‌شهر", "حر", "شمس‌آباد", "ابوحمیظه", "آبژدان", "چغامیش", "مینوشهر", "منصوریه", "سیاه‌منصور", "مشراگه", "چویبده", "الهایی", "کوت‌سیدنعیم", "ترکالکی", "رفیع", "میداوود", "گوریه", "سرداران", "صیدون", "جنت‌مکان", "عقیلی", "دهدز", "دارخوین", "زهره", "چم‌گلک", "کوت‌عبداله"]
    },
    {
        "name": "زنجان",
        "cities": ["زنجان", "ابهر", "خرمدره", "قیدار", "هیدج", "صائین‌قلعه", "آب‌بر", "سلطانیه", "سجاس", "ماهنشان", "سهرورد", "زرین‌رود", "گرماب", "دندی", "زرین‌آباد", "نوربهار", "کرسف", "حلب", "ارمغانخانه", "چورزق", "نیک‌پی"]
    },
    {
        "name": "سمنان",
        "cities": ["سمنان", "شاهرود", "دامغان", "گرمسار", "مهدی‌شهر", "ایوانکی", "بسطام", "سرخه", "آرادان", "مجن", "کلاته‌خیج", "درجزین", "میامی", "شهمیرزاد", "رودیان", "کلاته‌رودبار", "امیریه", "بیارجمند", "کهن‌آباد", "دیباج"]
    },
    {
        "name": "سیستان و بلوچستان",
        "cities": ["زاهدان", "زابل", "ایرانشهر", "چابهار", "سراوان", "خاش", "کنارک", "جالق", "نیک‌شهر", "پیشین", "سوران", "زهک", "فنوج", "گلمورتی", "اسپکه", "بمپور", "سرباز", "سیرکان", "راسک", "نگور", "میرجاوه", "قصرقند", "نصرت‌آباد", "بنت", "هیدوچ", "ادیمی", "محمدان", "بنجار", "دوست‌محمد", "زرآباد", "نوک‌آباد", "گشت", "محمدآباد", "محمدی", "علی‌اکبر"]
    },
    {
        "name": "فارس",
        "cities": ["شیراز", "مرودشت", "جهرم", "فسا", "کازرون", "صدرا", "داراب", "فیروزآباد", "لار", "آباده", "نورآباد", "نی‌ریز", "اقلید", "استهبان", "گراش", "زرقان", "کوار", "لامرد", "صفاشهر", "قائمیه", "حاجی‌آباد", "فراشبند", "قیر", "اوز", "خنج", "خرامه", "سروستان", "ارسنجان", "سعادت‌شهر", "قادرآباد", "اردکان", "دبیران", "تل‌بیضا", "خشت", "اشکنان", "بنارویه", "مصیری", "بوانات", "سیدان", "جویم", "بهمن", "قطب‌آباد", "آباده‌طشک", "خور", "بیرم", "لپویی", "کره‌ای", "خانه زنیان", "بالاده", "کوه‌نجان", "ششده", "مزایجان", "مه‌مُهر", "نوجین", "کامفیروز", "خاوران", "داریان", "لطیفی", "زاهدشهر", "نودان", "گله‌دار"]
    },
    {
        "name": "قزوین",
        "cities": ["قزوین", "الوند", "محمدیه", "تاکستان", "آبیک", "بوئین‌زهرا", "بیدستان", "محمودآباد نمونه", "شریفیه", "اقبالیه", "خاکعلی", "آبگرم", "اسفرورین", "ضیاءآباد", "خرمدشت", "آوج", "شال", "دانشسفی", "نرجه", "سگزآباد", "ارداق", "قشلاق", "کوهین", "رازمیان", "معلم‌کلایه", "سیردان"]
    },
    {
        "name": "قم",
        "cities": ["قم", "جعفریه", "پردیسان", "قنوات", "کهک", "دستجرد", "سلفچگان"]
    },
    {
        "name": "کردستان",
        "cities": ["سنندج", "سقز", "مریوان", "بانها", "قروه", "کامیاران", "بیجار", "دیواندره", "دهگلان", "کانی‌دینار", "سریش‌آباد", "دلبران", "سروآباد", "یاسوکند", "موزه", "بلبان‌آباد", "زرینه", "اورامان‌تخت", "صاحب", "آرمرده", "دزج", "بوئین‌سفلی", "شویشه", "کانی‌سور", "بابارشانی", "برده‌رشه"]
    },
    {
        "name": "کرمان",
        "cities": ["کرمان", "سیرجان", "رفسنجان", "جیرفت", "بم", "زرند", "کهنوج", "شهربابک", "بافت", "بردسیر", "راور", "عنبرآباد", "ماهان", "منوجان", "انار", "قلعه‌گنج", "رودبار", "فهرج", "گلباف", "کوهبنان", "چترود", "درب‌بهشت", "بروات", "یزدان‌شهر", "باغین", "رابر", "ریگان", "محمدآباد", "نجف‌شهر", "اختیارآباد", "خانوک", "کیانشهر", "محی‌اباد", "اندوهجرد", "زنگی‌آباد", "شهداد", "نودژ", "امیرشهر", "کاظم‌آباد", "ارزوئیه", "نگار", "مس‌سرچشمه", "جوپار", "جوزم", "دوساری", "خواجو شهر", "فاریاب", "ریحان‌شهر", "کوشکوئیه"]
    },
    {
        "name": "کرمانشاه",
        "cities": ["کرمانشاه", "اسلام‌آباد غرب", "جوانرود", "لنگرود", "هرسین", "سنقر", "صحنه", "پاوه", "روانسر", "گیلانغرب", "قصر شیرین", "تازه آباد", "کرند غرب", "بیستون", "گهواره", "کوزران", "ریجاب", "نودشه", "شاهو", "بانه‌وره", "سرمست", "گودین", "نوسود", "باینگان", "ازگله", "میان‌راهان", "سطر"]
    },
    {
        "name": "کهگیلویه و بویراحمد",
        "cities": ["یاسوج", "دوگنبدان", "دهدشت", "لیکک", "چرام", "لنده", "باشت", "سی‌سخت", "سوق", "دیشموک", "قلعه‌رئیسی", "مارگون", "پاتاوه", "سرفاریاب", "چیتاب", "گراب‌سفلی", "مادوان"]
    },
    {
        "name": "گلستان",
        "cities": ["گرگان", "گنبد کاووس", "بندر ترکمن", "علی‌آباد کتول", "آزادشهر", "کردکوی", "کلاله", "آق‌قلا", "مینودشت", "گالیکش", "بندر گز", "فاضل‌آباد", "گمیش‌تپه", "سیمین‌شهر", "رامیان", "خان‌ببین", "مراوه‌تپه", "دلند", "نگین‌شهر", "سرخنکلاته", "جلین", "انبارآلوم", "نوکنده", "فراغی", "تاتارعلیا", "سنگدوین", "مزرعه", "نوده خاندوز", "اینچه‌برون"]
    },
    {
        "name": "گیلان",
        "cities": ["رشت", "بندر انزلی", "لاهیجان", "لنگرود", "هشتپر", "آستارا", "صومعه‌سرا", "آستانه اشرفیه", "رودسر", "فومن", "خمام", "سیاهکل", "رضوانشهر", "ماسال", "منجیل", "املش", "کیآشهر", "رستم‌آباد", "لوشان", "سنگر", "کلاچای", "آستارا", "لشت نشا", "کوچصفهان", "اسالم", "احمدسرگوراب", "رودبار", "توتکابن", "جیرنده", "چاف و چمخاله", "چابکسر", "شفت", "پره‌سر", "خشکبیجار", "مرجقل", "کومله", "شاندرمن", "چوکام", "واجارگاه", "حویق", "لیسار", "رودبنه", "رانکوه", "بره‌سر", "دیلمان", "ماکوله", "بیجار"]
    },
    {
        "name": "لرستان",
        "cities": ["خرم‌آباد", "بروجرد", "دورو", "کوهدشت", "الیگودرز", "نورآباد", "ازنا", "الشتر", "پلدختر", "کونانی", "معمولان", "چقابل", "اشترینان", "فیروزآباد", "گراب", "سپیددشت", "زاغه", "چمن‌سلطان", "درب‌گنبد", "ویسیان", "مومن‌آباد", "شول‌آباد", "هفت‌چشمه", "سراب‌دوره"]
    },
    {
        "name": "مازندران",
        "cities": ["ساری", "بابل", "آمل", "قائم‌شهر", "بهشهر", "چالوس", "نکا", "بابلسر", "تنکابن", "نوشهر", "فریدون‌کنار", "رامسر", "جویبار", "محمودآباد", "امیرکلا", "نور", "گلوگاه", "کتالم و سادات‌شهر", "زیرآب", "عباس‌آباد", "خلیل‌شهر", "رستمکلا", "خرم‌آباد", "شیرود", "چمستان", "کلاردشت", "هچیرود", "سلمان‌شهر", "سورک", "شیرگاه", "پل‌سفید", "کیاکلا", "بهنمیر", "هادی‌شهر", "رویان", "ایزدشهر", "گتاب", "گلوگاه", "سرخرود", "مرزن‌آباد", "نشتارود", "کلارآباد", "آلاشت", "رینه", "پایین‌هولار", "بلده", "گزنک", "فریم", "زرگرمحله", "دابودشت", "کجور", "کوهی‌خیل"]
    },
    {
        "name": "مرکزی",
        "cities": ["اراک", "ساوه", "خمین", "محلات", "دلیجان", "مأمونیه", "شازند", "مهاجران", "تفرش", "غرق‌آباد", "خنداب", "آشتیان", "پرندک", "نیم‌ور", "زاویه", "فرمهین", "توده", "کمیجان", "خشمین", "جاورسیان", "آستانه", "شازند", "خشکرود", "میلاجرد", "رازقان", "نوبران", "قورچی‌باشی", "هندودر", "ساروق", "توره", "کارچان", "نراق"]
    },
    {
        "name": "هرمزگان",
        "cities": ["بندرعباس", "میناب", "قشم", "بندر کنگ", "بندر لنگه", "حاجی‌آباد", "رودان", "بندر خمیر", "پارسیان", "بستک", "بندر جاسک", "درگهان", "خمیر", "رویدر", "بیکاه", "جناح", "هشت‌بندی", "رمکان", "سوزا", "قلعه‌قاضی", "سیریک", "تیرور", "دشتی", "طبل", "زیارت‌علی", "فین", "تخت", "کوخرد", "هرنگ", "گروک", "بندر چارک", "لمزان", "سندرک", "فارغان", "کوشکنار", "سرگز", "ابوموسی"]
    },
    {
        "name": "همدان",
        "cities": ["همدان", "ملایر", "نهاوند", "تویسرکان", "اسدآباد", "کبودرآهنگ", "بهار", "رزن", "لالجین", "فامنین", "مریانج", "ازندریان", "قروه درجزین", "جورقان", "گیان", "صالح‌اباد", "مهاجران", "سامن", "فیروزان", "سرکان", "دمق", "قهاوند", "اسلام‌شهر آق‌گل", "آجین", "شیرین‌سو", "برزول", "جوکار", "گلان", "فرسفج", "زنگنه"]
    },
    {
        "name": "یزد",
        "cities": ["یزد", "میبد", "اردکان", "بافق", "مهریز", "ابرکوه", "اشکذر", "تفت", "شاهدیه", "حمیدیا", "زارچ", "بهاباد", "مهردشت", "مروست", "بفروئیه", "احمدآباد", "خضرآباد", "ندوشن", "عقدا", "نیر", "بخ"]
    }
];
